danusha2345/esp32-ntrip-DUO_danusha/main/web_server.c
static httpd_handle_t web_server_start(void)
{
    config_get_primitive(CONF_ITEM(KEY_CONFIG_ADMIN_AUTH), &auth_method);
    if (auth_method == AUTH_METHOD_BASIC) {
        char *username, *password;
        config_get_str_blob_alloc(CONF_ITEM(KEY_CONFIG_ADMIN_USERNAME), (void **) &username);
        config_get_str_blob_alloc(CONF_ITEM(KEY_CONFIG_ADMIN_PASSWORD), (void **) &password);
        basic_authentication = http_auth_basic_header(username, password);
        free(username);
        free(password);
    }

    httpd_handle_t server = NULL;
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    // Увеличиваем число доступных слотов под URI-обработчики: у нас >12 маршрутов
    // иначе httpd_register_uri_handler начнёт возвращать "no slots left" и файловый обработчик "/*" не зарегистрируется
    config.max_uri_handlers = 20;
    config.uri_match_fn = httpd_uri_match_wildcard;

    // Start the httpd server
    ESP_LOGI(TAG, "Starting server on port: '%d'", config.server_port);
    if (httpd_start(&server, &config) == ESP_OK) {
        // Register test endpoint for SPIFFS debugging
        register_uri_handler(server, "/test", HTTP_GET, test_spiffs_handler);
        
        // Register root handler first for explicit / requests
        register_uri_handler(server, "/", HTTP_GET, root_redirect_handler);
        
        register_uri_handler(server, "/config", HTTP_GET, config_get_handler);
        register_uri_handler(server, "/config", HTTP_POST, config_post_handler);
        register_uri_handler(server, "/status", HTTP_GET, status_get_handler);

        register_uri_handler(server, "/log", HTTP_GET, log_get_handler);
        register_uri_handler(server, "/core_dump", HTTP_GET, core_dump_get_handler);
        register_uri_handler(server, "/heap_info", HTTP_GET, heap_info_get_handler);

        register_uri_handler(server, "/wifi/scan", HTTP_GET, wifi_scan_get_handler);
        register_uri_handler(server, "/serial/send", HTTP_POST, serial_command_post_handler);
        register_uri_handler(server, "/sdlog/status", HTTP_GET, sd_log_status_handler);
        register_uri_handler(server, "/sdlog/toggle", HTTP_POST, sd_log_toggle_handler);

        // Wildcard handler for all files - MUST be last
        register_uri_handler(server, "/*", HTTP_GET, file_get_handler);
    }

    if (server == NULL) {
        ESP_LOGE(TAG, "Could not start server");
        return NULL;
    }

    buffer = malloc(BUFFER_SIZE);
    if (!buffer) {
        ESP_LOGE(TAG, "Failed to allocate buffer for web server");
        httpd_stop(server);
        return NULL;
    }

    return server;
}

void web_server_init() {
    esp_err_t ret = www_spiffs_init();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "SPIFFS initialization failed! Web interface will not work.");
        ESP_LOGE(TAG, "Error: %s (%d)", esp_err_to_name(ret), ret);
        // Continue anyway to start the server
    } else {
        ESP_LOGI(TAG, "SPIFFS initialized successfully");
    }
    
    httpd_handle_t server = web_server_start();
    if (server == NULL) {
        ESP_LOGE(TAG, "Failed to start web server");
    } else {
        ESP_LOGI(TAG, "Web server started successfully");
    }
}
